In [1]:
import pandas as pd

In [2]:
iris = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data',
                   names=['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species'])

In [3]:
print("first 5 rows of dataset iris:")
print(iris.head())

first 5 rows of dataset iris:
   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [4]:
print("\n=== BASIC DATASET INFO ===")
print(f"Number of rows: {len(iris)}")
print(f"Number of columns: {len(iris.columns)}")
print("\nColumn names:")
print(iris.columns.tolist())

=== BASIC DATASET INFO ===
Number of rows: 150
Number of columns: 5

Column names:
['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [5]:
print("null values of dataset")
print(iris.info())

null values of dataset
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB
None

In [6]:
print("null values of datset by column")
print(iris.isnull().sum())

null values of datset by column
sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [7]:
print(iris.describe())

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [8]:
print("Species distribution:")
print(iris['species'].value_counts())

Species distribution:
species
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

In [9]:
print(iris.dropna())

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [10]:
print(iris.isna())

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2           False        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [11]:
print(iris.tail())

     sepal_length  sepal_width  petal_length  petal_width         species
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [12]:
import numpy as np

In [17]:
#create our own dataset
days = ["sunday","monday","tuesday","wednesday","thursday","friday","saturday"]
jaipur = [34,23,34,23,67,34,np.nan]
jodhpur = [35,np.nan,45,76,34,67,32]
dic= {"days":days,"jaipur":jaipur,"jodhpur":jodhpur}

In [19]:
df=pd.DataFrame(dic)

In [21]:
df

        days  jaipur  jodhpur
0     sunday    34.0     35.0
1     monday    23.0      NaN
2    tuesday    34.0     45.0
3  wednesday    23.0     76.0
4   thursday    67.0     34.0
5     friday    34.0     67.0
6   saturday     NaN     32.0

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   days     7 non-null      object
 1   jaipur   6 non-null      float64
 2   jodhpur  6 non-null      float64
dtypes: float64(2), object(1)
memory usage: 300.0+ bytes

In [25]:
df.describe()

          jaipur    jodhpur
count   6.000000   6.000000
mean   35.833333  48.166667
std    16.191562  18.840559
min    23.000000  32.000000
25%    25.750000  34.250000
50%    34.000000  40.000000
75%    34.000000  61.500000
max    67.000000  76.000000

In [27]:
df.head()

        days  jaipur  jodhpur
0     sunday    34.0     35.0
1     monday    23.0      NaN
2    tuesday    34.0     45.0
3  wednesday    23.0     76.0
4   thursday    67.0     34.0

In [29]:
df.dropna()

        days  jaipur  jodhpur
0     sunday    34.0     35.0
2    tuesday    34.0     45.0
3  wednesday    23.0     76.0
4   thursday    67.0     34.0
5     friday    34.0     67.0

In [31]:
df.isna()

    days  jaipur  jodhpur
0  False   False    False
1  False   False     True
2  False   False    False
3  False   False    False
4  False   False    False
5  False   False    False
6  False    True    False

In [41]:
df.tail()

        days  jaipur  jodhpur
2    tuesday    34.0     45.0
3  wednesday    23.0     76.0
4   thursday    67.0     34.0
5     friday    34.0     67.0
6   saturday     NaN     32.0